<?php

namespace App\Models;

use Illuminate\Database\Eloquent\Model;

class Asset extends Model
{
    protected $guarded=[];
    public static $molds =  [0=>'外套',1=>'卫衣',2=>'衬衣',3=>'毛衣',4=>'大衣',5=>'羽绒服',6=>'短袖',7=>'长袖',8=>'秋衣',9=>'功能上衣',
                        10=>'牛仔裤',11=>'休闲裤',12=>'短裤',13=>'运动裤',14=>'秋裤',15=>'毛裤',16=>'功能裤',
                        17=>'功能鞋',18=>'帆布鞋',19=>'板鞋',20=>'雪地靴',21=>'拖鞋',22=>'休闲鞋',23=>'马丁靴',
                        24=>'围巾',25=>'帽子',26=>'睡衣',32=>'背包',34=>'配饰',
                        27=>'Music相关',28=>'电脑相关',29=>'手机相关',30=>'edc',31=>'相机相关',
                        33=>'coffee相关'];
    public static $type = [
        'clothes' =>[0=>'外套',1=>'卫衣',2=>'衬衣',3=>'毛衣',4=>'大衣',5=>'羽绒服',6=>'短袖',7=>'长袖',8=>'秋衣',9=>'功能上衣',
            10=>'牛仔裤',11=>'休闲裤',12=>'短裤',13=>'运动裤',14=>'秋裤',15=>'毛裤',16=>'功能裤'],
        'shoes' =>[17=>'功能鞋',18=>'帆布鞋',19=>'板鞋',20=>'雪地靴',21=>'拖鞋',22=>'休闲鞋',23=>'马丁靴'],
        'accessories' =>[24=>'围巾',25=>'帽子',26=>'睡衣',32=>'背包',34=>'配饰'],
        'product' =>['Music相关',28=>'电脑相关',29=>'手机相关',30=>'edc',31=>'相机相关'],
        'coffee' =>[33=>'coffee相关']
    ];
}
